---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetMaterialAbbreviation(System.Int32)
source: html/fc7879dd-dd2c-71f5-429b-b640d4ac20be.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetMaterialAbbreviation Method

Gets the abreviation of the material or the insulation or the double wall material.

## Syntax (C#)
```csharp
public string GetMaterialAbbreviation(
	int materialId
)
```

## Parameters
- **materialId** (`System.Int32`) - The material identifier.